# pymysql
- 파이썬에서 MySQL, MariaDB DBMS와 연동하는 다양한 함수를 제공하는 모듈
- Python [DB API 2.0](http://www.python.org/dev/peps/pep-0249) 표준을 따른다.
- https://github.com/PyMySQL/PyMySQL/
- https://pymysql.readthedocs.io/en/latest/

# 설치
- 조건
    - python version 3.6 이상
    - mysql version 5.6 이상
- 설치
    - `pip install PyMySQL`
    - `conda install -y -c conda-forge pymysql`

In [3]:
!dir

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: EA08-420F

 C:\class\01_python 기초 디렉터리

2022-06-02  오후 02:41    <DIR>          .
2022-06-02  오후 02:41    <DIR>          ..
2022-06-02  오후 02:41    <DIR>          .ipynb_checkpoints
2022-05-10  오후 05:57            61,210 01 변수와 데이터타입_.ipynb
2022-05-11  오후 04:56            54,653 02_자료구조_.ipynb
2022-05-13  오전 09:40            46,219 03_제어문_.ipynb
2022-05-16  오전 09:49            34,127 04_함수_.ipynb
2022-05-17  오후 03:16            57,782 05_객체지향프로그래밍_.ipynb
2022-05-18  오전 09:10            11,423 06_모듈_패키지_import.ipynb
2022-05-19  오전 10:10            36,543 07_예외처리_.ipynb
2022-05-20  오전 09:30            31,482 08_입출력_.ipynb
2022-05-20  오후 05:43            47,682 09_Iterator와 Decorator_.ipynb
2022-05-23  오후 05:58            41,772 10_파이썬 정규표현식_.ipynb
2022-06-02  오후 02:41             9,343 11_pymysql을 이용해 mysql연동.ipynb
2022-05-10  오후 12:18                14 a.py
2022-05-10  오후 12:18                14 a.txt
2022-05-19  오후 04:11                30 aaaaaa.txt
2022-05-19  오후 04:20                 6 aaabbbccc.txt
2022-05-19  오전 09:46               276 abc.txt
2022-05-19  오후 04:07                 0 adasdf
2022-05-20  오전 09:23                58 b.txt
2022-05-19  오후 12:18                38 c.txt
2022-05-19  오후 02:17           231,678 img.jpg
2022-05-19  오후 02:22           231,678 img2.jpg
2022-05-19  오후 02:27           231,678 img3.jpg
2022-05-19  오후 03:04                65 list.pkl
2022-05-19  오후 02:49               144 member.csv
2022-05-19  오후 05:20               148 member_2.csv
2022-05-19  오후 05:26               148 member_3.csv
2022-05-19  오후 04:18    <DIR>          my_package
2022-05-17  오후 03:18               149 test.py
2022-05-19  오후 04:10                33 test.txt
2022-05-24  오전 11:44    <DIR>          text_data
2020-11-18  오전 10:49               365 TODO_IO.txt
2022-05-17  오후 05:51               706 utils.py
2022-05-17  오후 06:02             1,785 utils_mypackage.zip
2022-05-17  오후 05:40    <DIR>          __pycache__
              31개 파일           1,131,249 바이트
               6개 디렉터리  192,306,241,536 바이트 남음

In [1]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

# 기본 작성 절차

1. Database 연결
    ```python
       connection =  pymysql.connect(host="DBMS 서버 ip", 
                                     port="port번호", 
                                     user="계정명", 
                                     password="비밀번호", 
                                     db="연결할데이터베이스이름", 
                                     charset='utf8')
    ```
    - port 번호 기본값: 3306
2. Connection을 이용해 Cursor 생성
    - Cursor: 연결된 Database에 sql문을 전송하고 select결과 조회 기능을 제공하는 객체
    ```python
        cursor = connection.cursor()
    ```
3. Cusror를 이용해 SQL문 전송
    ```python
        cursor.execute("sql문")
    ```
4. 연결 닫기
    - cursor, connection 연결을 닫는다.
    - with문을 이용할 수 있다. 
    ```python
    cursor.close()
    connection.close()
    ```

# 예제

## 테이블 생성 
- 참고) pymyql 을 이용해서는 DML(insert, update, delete, update)문을 실행한다. (DDL은 거의 실행하지 않는다.)

In [51]:
# import
import pymysql

# DB 연결 - connect() => 연결 실패시 Exception 발생
connection = pymysql.connect(host='127.0.0.1', 
                             port=3306,
                             user='scott',
                             password='tiger',
                             db='testdb')
print(type(connection))

<class 'pymysql.connections.Connection'>

In [52]:
# Cursor를 Connection으로 부터 얻어온다. - Cursor: sql문 실행을 관리하는 객체.
cursor = connection.cursor()
print(type(cursor))

<class 'pymysql.cursors.Cursor'>

In [54]:
# sql 문 실행 => 쿼리문 실행 실패시(sql문을 잘못 짠 경우, 제약조건 문제) -> Exception 발생
# sql 문은 string을 정의. execute() 메소드를 이용해서 DB에 전송.
sql = """
create table test_user (
  id  int  auto_increment  primary key, 
  name  varchar(30) not null,
  email varchar(100) not null unique,
  tall  decimal(5,2),
  birthday date
)
"""
cursor.execute('drop table if exists test_user')
cursor.execute(sql)  # 실행

0

In [55]:
# 연결닫기 - cursor, connection close
cursor.close()
connection.close()

## DML
### insert

In [60]:
import pymysql # auto commit=False

sql = "insert into test_user (name, email, tall, birthday) values ('홍길동', 'hong@a.com', 182.23, '2000-02-03')"
try:
    # 연결
    connection = pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8')
    # cursor 생성
    cursor = connection.cursor()
    # insert문 실행
    cnt = cursor.execute(sql)
    connection.commit() # insert/delete/update 문 실행 후 commit 처리를 해야 한다.
    print(f"{cnt} 행이 insert 되었습니다.")
    
except Exception as e:
    if connection:
        connection.rollback()
    print(e)
finally:
#     연결 닫기
    if cursor: # if cursor!=None:
        cursor.close()
    if connection: # != None:
        connection.close()

1 행이 insert 되었습니다.

In [61]:
# with 문
# with 연결함수 as 변수
sql = "insert into test_user (name, email, tall, birthday) values ('홍길동2', 'hong2@a.com', 172.23, '2005-02-03')"
with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8') as connection:
    with connection.cursor() as cursor:
        cnt = cursor.execute(sql)
        print(f'{cnt} 행이 insert됨')
        connection.commit()

1 행이 insert됨

In [62]:
def insert_user(name, email, tall, birthday):
    sql = f"insert into test_user (name, email, tall, birthday) values ('{name}', '{email}', {tall}, '{birthday}')"
    with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8') as connection:
        with connection.cursor() as cursor:
            cnt = cursor.execute(sql)
            print(f'{cnt} 행이 insert됨')
            connection.commit()

In [63]:
insert_user('이순신', 'lee@a.com', 190.20, '1995-10-22')

1 행이 insert됨

### Parameterized Query
- Parameterized Query
    - SQL 문에서 컬럼 값이 들어가는 자리에 값대신 `%s` placeholder를 사용한뒤 execute()에서 placeholder에 넣을 값을 tuple로 제공한다.
    - query문을 쉽게 작성할 수 있는 장점이 있다.

In [27]:
date(1999, 3, 2)# --- sql date

datetime.date(1999, 3, 2)

In [28]:
# datetime 모듈: 날짜-date, 시간-time, 날짜시간 - datetime 등 날짜와 시간을 다루는 모듈. -> DB의 날짜/시간 타입과 연동.
from datetime import date
sql = 'insert into test_user (name, email, tall, birthday) values (%s, %s, %s, %s)'
with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8') as connection:
    with connection.cursor() as cursor:
        cnt = cursor.execute(sql, ('유관순', 'yoo2@a.com', 175.3, '2000-01-02'))
        cnt2 = cursor.execute(sql, ('강감찬', 'kang@a.com', 170.3, date(1995,2,3)))
        print(f'{cnt} 행이 insert됨')
        print(f'{cnt2} 행이 insert됨')
        connection.commit()

1 행이 insert됨
1 행이 insert됨

### Parameterized Query를 이용해 여러개 행 insert

#### for문 사용

In [29]:
names = ['이름1', '이름2', '이름3']
emails = ['e1@a.com', 'e2@a.com', 'e3@a.com']
talls = [192.4, 185.2, 178,6]
birthdays = ['2000-10-10', date.today(), '1999-05-07']

In [31]:
sql = 'insert into test_user (name, email, tall, birthday) values (%s, %s, %s, %s)'
with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8') as connection:
    with connection.cursor() as cursor:
        for data in zip(names, emails, talls, birthdays):
            cursor.execute(sql, data)
        
        connection.commit()

#### executemany() 사용
- insert할 값들을 가진 리스트를 넣어 한번에 여러 행을 insert한다.

In [36]:
datas = [
    ['name1', 'a1@a.com', 172.3, '2000-02-22'],
    ['name2', 'a2@a.com', 182.44, '2001-03-20'],
    ['name3', 'a3@a.com', 162.44, '2005-03-10'],
]
sql = 'insert into test_user (name, email, tall, birthday) values (%s, %s, %s, %s)'
with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8') as connection:
    with connection.cursor() as cursor:
        cursor.executemany(sql, datas)
        connection.commit()

### update/delete
- 코딩 절차는 insert 와 동일

In [37]:
update_sql = "update test_user set tall = tall + 10, birthday = '2000-01-01'"
with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8') as connection:
    with connection.cursor() as cursor:
        cnt = cursor.execute(update_sql)
        connection.commit()
        print(f'{cnt}행이 update 됨')

12행이 update 됨

In [40]:
def update_user_by_id(id, name, email, tall, birthday):
    update_sql = 'update test_user set name=%s, email=%s, tall=%s, birthday=%s where id=%s'
    with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8') as connection:
        with connection.cursor() as cursor:
            cnt = cursor.execute(update_sql, (name, email, tall, birthday, id))
            connection.commit()
            return cnt

In [41]:
update_user_by_id(2, '홍길동', 'honggildong@abc.com', 192.23, '1990-10-10')

1

In [43]:
# delete
delete_sql = "delete from test_user where id = %s"
with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8') as connection:
    with connection.cursor() as cursor:
        cnt = cursor.execute(delete_sql, (2,))
        print(cnt)
        connection.commit()

0

In [46]:
def delete_user_by_id(id):
    delete_sql = "delete from test_user where id = %s"
    with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8') as connection:
        with connection.cursor() as cursor:
            cnt = cursor.execute(delete_sql, (id,))
            connection.commit()
            return cnt

In [47]:
delete_user_by_id(2)

0

In [48]:
delete_user_by_id(4)

1

In [50]:
id = 20
a = (id, )
print(a, type(a))

(20,) <class 'tuple'>

## select (DQL-Data Query Language)
- 조회결과 조회
    - cursor.execute("select문") 실행 후 cursor의 결과 조회 메소드(fetch메소드)를 이용해 결과를 받는다.
- fetch메소드
    - **fetchall()**
        - 조회한 모든 행을을 반환
    - **fetchmany(size=개수)**
        - 지정한 size개수 만큼 반환
    - **fetchone()**
        - 조회결과 중 첫번째 행만 반환
        - 주로 pk 동등 조건으로 조회한 경우 사용

### fetchall()

In [7]:
import pymysql

sql = 'select * from test_user'

with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8') as connection:
    with connection.cursor() as cursor:
#       select문 실행
        print(type(cursor))
        cursor.execute(sql)
#       select 결과 조회 (cursor.fetchXXX() 메소드 이용)
        result = cursor.fetchall()

<class 'pymysql.cursors.Cursor'>

In [5]:
print(type(result), len(result))
print(type(result[0]))
result

<class 'tuple'> 6
<class 'tuple'>

((1, '홍길동', 'hong@a.com', Decimal('182.23'), datetime.date(2000, 2, 3)),
 (2, '홍길동2', 'hong2@a.com', Decimal('172.23'), datetime.date(2005, 2, 3)),
 (3, '이순신', 'lee@a.com', Decimal('190.20'), datetime.date(1995, 10, 22)),
 (4, '홍길동', 'hong@a.com', Decimal('182.23'), datetime.date(2000, 2, 3)),
 (5, '홍길동2', 'hong2@a.com', Decimal('172.23'), datetime.date(2005, 2, 3)),
 (6, '이순신', 'lee@a.com', Decimal('190.20'), datetime.date(1995, 10, 22)))

In [9]:
sql = 'select * from test_user'
with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8', 
                     cursorclass=pymysql.cursors.DictCursor) as connection:   # 조회결과를 dictionary로 반환하는 커서.
    with connection.cursor() as cursor:
        print(type(cursor))
        cursor.execute(sql)
        result = cursor.fetchall()

<class 'pymysql.cursors.DictCursor'>

In [13]:
print(type(result), len(result))
print(type(result[0])) #dict: key-컬럼명, value-컬럼값
result

<class 'list'> 6
<class 'dict'>

[{'id': 1,
  'name': '홍길동',
  'email': 'hong@a.com',
  'tall': Decimal('182.23'),
  'birthday': datetime.date(2000, 2, 3)},
 {'id': 2,
  'name': '홍길동2',
  'email': 'hong2@a.com',
  'tall': Decimal('172.23'),
  'birthday': datetime.date(2005, 2, 3)},
 {'id': 3,
  'name': '이순신',
  'email': 'lee@a.com',
  'tall': Decimal('190.20'),
  'birthday': datetime.date(1995, 10, 22)},
 {'id': 4,
  'name': '홍길동',
  'email': 'hong@a.com',
  'tall': Decimal('182.23'),
  'birthday': datetime.date(2000, 2, 3)},
 {'id': 5,
  'name': '홍길동2',
  'email': 'hong2@a.com',
  'tall': Decimal('172.23'),
  'birthday': datetime.date(2005, 2, 3)},
 {'id': 6,
  'name': '이순신',
  'email': 'lee@a.com',
  'tall': Decimal('190.20'),
  'birthday': datetime.date(1995, 10, 22)}]

In [15]:
result[0]['id'], result[0]['email']

(1, 'hong@a.com')

In [20]:
sql = 'select id, name from test_user'
with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8', 
                     ) as connection:   # 조회결과를 dictionary로 반환하는 커서.
    with connection.cursor() as cursor:
        cursor.execute(sql)
        result = cursor.fetchall()
print(result)
print("2번 행의 이름:", result[1][1])

((1, '홍길동'), (2, '홍길동2'), (3, '이순신'), (4, '홍길동'), (5, '홍길동2'), (6, '이순신'))
2번 행의 이름: 홍길동2

### fetchone()

In [30]:
sql = 'select * from test_user where id = %s'  #pk 로 조회. - 조회결과 0 또는 1 행
with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8') as connection:
    with connection.cursor() as cursor:
        cursor.execute(sql, (10, ))  
        result = cursor.fetchone()#조회결과가 없으면 None을 있으면 1개의 데이터를 반환 => where 에서 pk로 조회할 경우 사용.
print(result)
if result:
    print(len(result))

None

In [31]:
sql = 'select * from test_user' 
with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8') as connection:
    with connection.cursor() as cursor:
        cursor.execute(sql)    
        result = cursor.fetchone()  # 여러행이 조회된 경우에서 한행만(첫번째행) 반환

In [32]:
result

(1, '홍길동', 'hong@a.com', Decimal('182.23'), datetime.date(2000, 2, 3))

### fetchmany()

In [40]:
sql = "select * from test_user"
with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8') as connection:
    with connection.cursor() as cursor:
        cursor.execute(sql)
        result = cursor.fetchmany(size=3)

In [41]:
print(len(result))
result

1

((1, '홍길동', 'hong@a.com', Decimal('182.23'), datetime.date(2000, 2, 3)),)

### cursor 는 iterable 타입
- for문에 select 실행한 cursor를 사용하면 조회결과를 한 행씩 조회할 수 있다.

In [42]:
sql = "select * from test_user"
with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8') as connection:
    with connection.cursor() as cursor:
        cursor.execute(sql)
        for data in cursor:  #한번 반복시 마다 조회결과를 한행씩 반환
            print(data)

(1, '홍길동', 'hong@a.com', Decimal('182.23'), datetime.date(2000, 2, 3))
(2, '홍길동2', 'hong2@a.com', Decimal('172.23'), datetime.date(2005, 2, 3))
(3, '이순신', 'lee@a.com', Decimal('190.20'), datetime.date(1995, 10, 22))
(4, '홍길동', 'hong@a.com', Decimal('182.23'), datetime.date(2000, 2, 3))
(5, '홍길동2', 'hong2@a.com', Decimal('172.23'), datetime.date(2005, 2, 3))
(6, '이순신', 'lee@a.com', Decimal('190.20'), datetime.date(1995, 10, 22))

## TODO
- DB: hr   (emp 테이블)

In [46]:
import pymysql

In [47]:
# 1개의 행을 emp 테이블에 insert 하는 함수 - 호출해서 값 insert
# Null을 허용하는 컬럼, default값이 있는 컬럼들은 기본값이 있는 매개변수로 선언한다. (null=>None)
def insert_emp(emp_id, emp_name, job, hire_date, mgr_id=None, salary=None, comm_pct=None, dept_name=None):
    sql = 'insert into emp values(%s, %s, %s, %s, %s, %s, %s, %s)'
    with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='hr', charset='utf8') as connection:
        with connection.cursor() as cursor:
            cnt = cursor.execute(sql, (emp_id, emp_name, job, mgr_id, hire_date, salary, comm_pct, dept_name))
            connection.commit()
            return cnt

In [52]:
insert_emp(401, '홍길동', '기획', '2020-10-10', 100, 3000, 0.2, '기획부')

1

In [53]:
insert_emp(402, '박영수', '구매', '2000-01-03')

1

In [54]:
# emp 테이블의 데이터를 수정하는 함수 - emp_id(where)로 나머지 정보를 수정. 
# 호출: 안바뀌는 값, 바뀐값 모두 argument로 전달.
def update_emp(emp_id, emp_name, job, hire_date, mgr_id, salary, comm_pct, dept_name):
    sql = "update emp set emp_name=%s, job=%s, hire_date=%s, mgr_id=%s, salary=%s, comm_pct=%s, dept_name=%s where emp_id=%s"
    with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='hr', charset='utf8') as connection:
        with connection.cursor() as cursor:
            cnt = cursor.execute(sql, (emp_name, job, hire_date, mgr_id,  salary, comm_pct, dept_name, emp_id))
            connection.commit()
            return cnt

In [56]:
# 206	William	AC_ACCOUNT	205	2002-06-07	8300.00		Accounting
update_emp(206, '윌리암', '회계', '2002-06-07', 205,  18300, None, 'Accounting')

1

In [57]:
# emp_id를 매개변수로 받아서 그 emp_id의 직원을 삭제하는 함수
def delete_emp_by_emp_id(emp_id):
    sql = 'delete from emp where emp_id=%s'
    with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='hr', charset='utf8') as connection:
        with connection.cursor() as cursor:
            cnt = cursor.execute(sql, (emp_id, ))
            connection.commit()
            return cnt

In [58]:
delete_emp_by_emp_id(300)

1

In [59]:
delete_emp_by_emp_id(301)

1

In [60]:
# job을 매개변수로 받아서 그 job의 직원들을 삭제하는 함수
def delete_emp_by_emp_job(job):
    sql = 'delete from emp where job=%s'
    with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='hr', charset='utf8') as connection:
        with connection.cursor() as cursor:
            cnt = cursor.execute(sql, (job, ))
            connection.commit()
            return cnt

In [62]:
delete_emp_by_emp_job('SH_CLERK')

20

In [63]:
# 전체 직원을 조회한 결과를 반환하는 함수.
def select_all_emp():
    sql = 'select * from emp'
    with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='hr', charset='utf8') as connection:
        with connection.cursor() as cursor:
            cursor.execute(sql)
            result = cursor.fetchall()
            return result

In [65]:
r = select_all_emp()
print(len(r))
print(r)

91
((100, 'Steven', 'AD_PRES', None, datetime.date(2003, 6, 17), Decimal('24000.00'), None, 'Executive'), (101, 'Neena', 'AD_VP', 100, datetime.date(2005, 9, 21), Decimal('17000.00'), None, 'Executive'), (102, 'Lex', 'AD_VP', 100, datetime.date(2001, 1, 13), Decimal('17000.00'), None, 'Executive'), (103, 'Alexander', 'IT_PROG', 102, datetime.date(2006, 1, 3), Decimal('9000.00'), None, 'IT'), (104, 'Bruce', 'IT_PROG', 103, datetime.date(2007, 5, 21), Decimal('6000.00'), None, 'IT'), (105, 'David', 'IT_PROG', 103, datetime.date(2005, 6, 25), Decimal('4800.00'), None, 'IT'), (106, 'Valli', 'IT_PROG', 103, datetime.date(2006, 2, 5), Decimal('4800.00'), None, 'IT'), (107, 'Diana', 'IT_PROG', 103, datetime.date(2007, 2, 7), Decimal('4200.00'), None, 'IT'), (108, 'Nancy', 'FI_MGR', 101, datetime.date(2002, 8, 17), Decimal('12008.00'), None, 'Finance'), (109, 'Daniel', 'FI_ACCOUNT', 108, datetime.date(2002, 8, 16), Decimal('9000.00'), None, 'Finance'), (110, 'John', 'FI_ACCOUNT', 108, datetime.date(2005, 9, 28), Decimal('8200.00'), None, 'Finance'), (111, 'Ismael', 'FI_ACCOUNT', 108, datetime.date(2005, 9, 30), Decimal('7700.00'), None, 'Finance'), (112, 'Jose Manuel', 'FI_ACCOUNT', 108, datetime.date(2006, 3, 7), Decimal('7800.00'), None, 'Finance'), (113, 'Luis', 'FI_ACCOUNT', 108, datetime.date(2007, 12, 7), Decimal('6900.00'), None, 'Finance'), (114, 'Den', 'PU_MAN', 100, datetime.date(2002, 12, 7), Decimal('11000.00'), None, 'Purchasing'), (115, 'Alexander', 'PU_MAN', 100, datetime.date(2003, 5, 18), Decimal('7100.00'), None, 'Purchasing'), (116, 'Shelli', 'PU_CLERK', 114, datetime.date(2005, 12, 24), Decimal('2900.00'), None, 'Purchasing'), (117, 'Sigal', 'PU_CLERK', 115, datetime.date(2005, 7, 24), Decimal('2800.00'), None, 'Purchasing'), (118, 'Guy', 'PU_CLERK', 115, datetime.date(2006, 11, 15), Decimal('2600.00'), None, 'Purchasing'), (119, 'Karen', 'PU_CLERK', 114, datetime.date(2007, 8, 10), Decimal('2500.00'), None, 'Purchasing'), (120, 'Matthew', 'ST_MAN', 100, datetime.date(2004, 7, 18), Decimal('8000.00'), None, 'Shipping'), (121, 'Adam', 'ST_MAN', 100, datetime.date(2005, 4, 10), Decimal('8200.00'), None, 'Shipping'), (122, 'Payam', 'ST_MAN', 100, datetime.date(2003, 5, 1), Decimal('7900.00'), None, 'Shipping'), (123, 'Shanta', 'ST_MAN', 100, datetime.date(2005, 10, 10), Decimal('6500.00'), None, 'Shipping'), (124, 'Kevin', 'ST_MAN', 100, datetime.date(2007, 11, 16), Decimal('5800.00'), None, 'Shipping'), (125, 'Julia', 'ST_CLERK', 120, datetime.date(2005, 7, 16), Decimal('3200.00'), None, 'Shipping'), (126, 'Irene', 'ST_CLERK', 120, datetime.date(2006, 9, 28), Decimal('2700.00'), None, 'Shipping'), (127, 'James', 'ST_CLERK', 120, datetime.date(2007, 1, 14), Decimal('2400.00'), None, 'Shipping'), (128, 'Steven', 'ST_CLERK', 120, datetime.date(2008, 3, 8), Decimal('2200.00'), None, 'Shipping'), (129, 'Laura', 'ST_CLERK', 121, datetime.date(2005, 8, 20), Decimal('3300.00'), None, 'Shipping'), (130, 'Mozhe', 'ST_CLERK', 121, datetime.date(2005, 10, 30), Decimal('2800.00'), None, 'Shipping'), (131, 'James', 'ST_CLERK', 121, datetime.date(2005, 2, 16), Decimal('2500.00'), None, 'Shipping'), (132, 'TJ', 'ST_CLERK', 121, datetime.date(2007, 4, 10), Decimal('2100.00'), None, 'Shipping'), (133, 'Jason', 'ST_CLERK', 122, datetime.date(2004, 6, 14), Decimal('3300.00'), None, 'Shipping'), (134, 'Michael', 'ST_CLERK', 122, datetime.date(2006, 8, 26), Decimal('2900.00'), None, 'Shipping'), (135, 'Ki', 'ST_CLERK', 122, datetime.date(2007, 12, 12), Decimal('2400.00'), None, 'Shipping'), (136, 'Hazel', 'ST_CLERK', 122, datetime.date(2008, 2, 6), Decimal('2200.00'), None, 'Shipping'), (137, 'Renske', 'ST_CLERK', 123, datetime.date(2003, 7, 14), Decimal('3600.00'), None, 'Shipping'), (138, 'Stephen', 'ST_CLERK', 123, datetime.date(2005, 10, 26), Decimal('3200.00'), None, 'Shipping'), (139, 'John', 'ST_CLERK', 123, datetime.date(2006, 2, 12), Decimal('2700.00'), None, 'Shipping'), (140, 'Joshua', 'ST_CLERK', 123, datetime.date(2006, 4, 6), Decimal('2500.00'), None, 'Shipping'), (141, 'Trenna', 'ST_CLERK', 124, datetime.date(2003, 10, 17), Decimal('3500.00'), None, 'Shipping'), (142, 'Curtis', 'ST_CLERK', 124, datetime.date(2005, 1, 29), Decimal('3100.00'), None, 'Shipping'), (143, 'Randall', 'ST_CLERK', 124, datetime.date(2006, 3, 15), Decimal('2600.00'), None, 'Shipping'), (144, 'Peter', 'ST_CLERK', 124, datetime.date(2006, 7, 9), Decimal('2500.00'), None, 'Shipping'), (145, 'John', 'SA_MAN', 100, datetime.date(2004, 10, 1), Decimal('14000.00'), Decimal('0.40'), 'Sales'), (146, 'Karen', 'SA_MAN', 100, datetime.date(2005, 1, 5), Decimal('13500.00'), Decimal('0.30'), 'Sales'), (147, 'Alberto', 'SA_MAN', 100, datetime.date(2005, 3, 10), Decimal('12000.00'), Decimal('0.30'), None), (148, 'Gerald', 'SA_MAN', 100, datetime.date(2007, 10, 15), Decimal('11000.00'), Decimal('0.30'), 'Sales'), (149, 'Eleni', 'SA_MAN', 100, datetime.date(2008, 1, 29), Decimal('10500.00'), Decimal('0.20'), 'Sales'), (150, 'Peter', 'SA_REP', 145, datetime.date(2005, 1, 30), Decimal('10000.00'), Decimal('0.30'), 'Sales'), (151, 'David', 'SA_REP', 145, datetime.date(2005, 3, 24), Decimal('9500.00'), Decimal('0.25'), 'Sales'), (152, 'Peter', 'SA_REP', 145, datetime.date(2005, 8, 20), Decimal('9000.00'), Decimal('0.25'), 'Sales'), (153, 'Christopher', 'SA_REP', 145, datetime.date(2006, 3, 30), Decimal('8000.00'), Decimal('0.20'), 'Sales'), (154, 'Nanette', 'SA_REP', 145, datetime.date(2006, 12, 9), Decimal('7500.00'), Decimal('0.20'), 'Sales'), (155, 'Oliver', 'SA_REP', 145, datetime.date(2007, 11, 23), Decimal('7000.00'), Decimal('0.15'), 'Sales'), (156, 'Janette', 'SA_REP', 146, datetime.date(2004, 1, 30), Decimal('10000.00'), Decimal('0.35'), 'Sales'), (157, 'Patrick', 'SA_REP', 146, datetime.date(2004, 3, 4), Decimal('9500.00'), Decimal('0.35'), 'Sales'), (158, 'Allan', 'SA_REP', 146, datetime.date(2004, 8, 1), Decimal('9000.00'), Decimal('0.35'), 'Sales'), (159, 'Lindsey', 'SA_REP', 146, datetime.date(2005, 3, 10), Decimal('8000.00'), Decimal('0.30'), 'Sales'), (160, 'Louise', 'SA_REP', 146, datetime.date(2005, 12, 15), Decimal('7500.00'), Decimal('0.30'), 'Sales'), (161, 'Sarath', 'SA_REP', 146, datetime.date(2006, 11, 3), Decimal('7000.00'), Decimal('0.25'), 'Sales'), (162, 'Clara', 'SA_REP', 147, datetime.date(2005, 11, 11), Decimal('10500.00'), Decimal('0.25'), 'Sales'), (163, 'Danielle', 'SA_REP', 147, datetime.date(2007, 3, 19), Decimal('9500.00'), Decimal('0.15'), 'Sales'), (164, 'Mattea', 'SA_REP', 147, datetime.date(2008, 1, 24), Decimal('7200.00'), Decimal('0.10'), 'Sales'), (165, 'David', 'SA_REP', 147, datetime.date(2008, 2, 23), Decimal('6800.00'), Decimal('0.10'), 'Sales'), (166, 'Sundar', 'SA_REP', 147, datetime.date(2008, 3, 24), Decimal('6400.00'), Decimal('0.10'), 'Sales'), (167, 'Amit', 'SA_REP', 147, datetime.date(2008, 4, 21), Decimal('6200.00'), Decimal('0.10'), 'Sales'), (168, 'Lisa', 'SA_REP', 148, datetime.date(2005, 3, 11), Decimal('11500.00'), Decimal('0.25'), 'Sales'), (169, 'Harrison', 'SA_REP', 148, datetime.date(2006, 3, 23), Decimal('10000.00'), Decimal('0.20'), 'Sales'), (170, 'Tayler', 'SA_REP', 148, datetime.date(2006, 1, 24), Decimal('9600.00'), Decimal('0.20'), 'Sales'), (171, 'William', 'SA_REP', 148, datetime.date(2007, 2, 23), Decimal('7400.00'), Decimal('0.15'), 'Sales'), (172, 'Elizabeth', 'SA_REP', 148, datetime.date(2007, 3, 24), Decimal('7300.00'), Decimal('0.15'), 'Sales'), (173, 'Sundita', 'SA_REP', 148, datetime.date(2008, 4, 21), Decimal('6100.00'), Decimal('0.10'), 'Sales'), (174, 'Ellen', 'SA_REP', 149, datetime.date(2004, 5, 11), Decimal('11000.00'), Decimal('0.30'), 'Sales'), (175, 'Alyssa', 'SA_REP', 149, datetime.date(2005, 3, 19), Decimal('8800.00'), Decimal('0.25'), 'Sales'), (176, 'Jonathon', 'SA_REP', 149, datetime.date(2006, 3, 24), Decimal('8600.00'), Decimal('0.20'), 'Sales'), (177, 'Jack', 'SA_REP', 149, datetime.date(2006, 4, 23), Decimal('8400.00'), Decimal('0.20'), 'Sales'), (178, 'Kimberely', 'SA_REP', 149, datetime.date(2007, 5, 24), Decimal('7000.00'), Decimal('0.15'), None), (179, 'Charles', 'SA_REP', 149, datetime.date(2008, 1, 4), Decimal('6200.00'), Decimal('0.10'), 'Sales'), (200, 'Jenni%fer', 'AD_ASST', 101, datetime.date(2003, 9, 17), Decimal('4400.00'), None, 'Administration'), (201, 'Michael', 'MK_MAN', 100, datetime.date(2004, 2, 17), Decimal('13000.00'), None, 'Marketing'), (202, 'Pat', 'MK_REP', 201, datetime.date(2005, 8, 17), Decimal('6000.00'), None, 'Marketing'), (203, 'Susan', 'HR_REP', 101, datetime.date(2002, 6, 7), Decimal('6500.00'), None, 'Human Resources'), (204, 'Hermann', 'PR_REP', 101, datetime.date(2002, 6, 7), Decimal('10000.00'), None, 'Public Relations'), (205, 'Shelley', 'AC_MGR', 101, datetime.date(2002, 6, 7), Decimal('12008.00'), None, 'Accounting'), (206, '윌리암', '회계', 205, datetime.date(2002, 6, 7), Decimal('18300.00'), None, 'Accounting'), (302, '강감찬', 'AC_ACCOUNT', 205, datetime.date(2020, 1, 3), Decimal('10000.00'), None, None), (303, '이순신', 'AC_ACCOUNT', 205, datetime.date(2020, 1, 3), Decimal('10000.00'), Decimal('0.10'), None), (401, '홍길동', '기획', 100, datetime.date(2020, 10, 10), Decimal('3000.00'), Decimal('0.20'), '기획부'), (402, '박영수', '구매', None, datetime.date(2000, 1, 3), None, None, None))

In [66]:
# emp_id를 매개변수로 받아서 그 직원 정보를 조회한 결과를 반환하는 함수
def select_emp_by_emp_id(emp_id):
    sql = 'select * from emp where emp_id=%s'  #PK 조회
    with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='hr', charset='utf8') as connection:
        with connection.cursor() as cursor:
            cursor.execute(sql, (emp_id, ))
            return cursor.fetchone()

In [67]:
r = select_emp_by_emp_id(100)
print(r)

(100, 'Steven', 'AD_PRES', None, datetime.date(2003, 6, 17), Decimal('24000.00'), None, 'Executive')

In [68]:
r = select_emp_by_emp_id(800)
print(r)

None

In [69]:
# dept_name을 매개변수로 받아서 그 부서의 직원들을 조회한 결과를 반환하는 함수
def select_emp_by_dept_name(dept_name):
    sql = 'select * from emp where dept_name=%s'
    with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='hr', charset='utf8') as connection:
        with connection.cursor() as cursor:
            cursor.execute(sql, (dept_name, ))
            return cursor.fetchall()

In [72]:
r = select_emp_by_dept_name('Sales')
print(len(r))
print(r)

33
((145, 'John', 'SA_MAN', 100, datetime.date(2004, 10, 1), Decimal('14000.00'), Decimal('0.40'), 'Sales'), (146, 'Karen', 'SA_MAN', 100, datetime.date(2005, 1, 5), Decimal('13500.00'), Decimal('0.30'), 'Sales'), (148, 'Gerald', 'SA_MAN', 100, datetime.date(2007, 10, 15), Decimal('11000.00'), Decimal('0.30'), 'Sales'), (149, 'Eleni', 'SA_MAN', 100, datetime.date(2008, 1, 29), Decimal('10500.00'), Decimal('0.20'), 'Sales'), (150, 'Peter', 'SA_REP', 145, datetime.date(2005, 1, 30), Decimal('10000.00'), Decimal('0.30'), 'Sales'), (151, 'David', 'SA_REP', 145, datetime.date(2005, 3, 24), Decimal('9500.00'), Decimal('0.25'), 'Sales'), (152, 'Peter', 'SA_REP', 145, datetime.date(2005, 8, 20), Decimal('9000.00'), Decimal('0.25'), 'Sales'), (153, 'Christopher', 'SA_REP', 145, datetime.date(2006, 3, 30), Decimal('8000.00'), Decimal('0.20'), 'Sales'), (154, 'Nanette', 'SA_REP', 145, datetime.date(2006, 12, 9), Decimal('7500.00'), Decimal('0.20'), 'Sales'), (155, 'Oliver', 'SA_REP', 145, datetime.date(2007, 11, 23), Decimal('7000.00'), Decimal('0.15'), 'Sales'), (156, 'Janette', 'SA_REP', 146, datetime.date(2004, 1, 30), Decimal('10000.00'), Decimal('0.35'), 'Sales'), (157, 'Patrick', 'SA_REP', 146, datetime.date(2004, 3, 4), Decimal('9500.00'), Decimal('0.35'), 'Sales'), (158, 'Allan', 'SA_REP', 146, datetime.date(2004, 8, 1), Decimal('9000.00'), Decimal('0.35'), 'Sales'), (159, 'Lindsey', 'SA_REP', 146, datetime.date(2005, 3, 10), Decimal('8000.00'), Decimal('0.30'), 'Sales'), (160, 'Louise', 'SA_REP', 146, datetime.date(2005, 12, 15), Decimal('7500.00'), Decimal('0.30'), 'Sales'), (161, 'Sarath', 'SA_REP', 146, datetime.date(2006, 11, 3), Decimal('7000.00'), Decimal('0.25'), 'Sales'), (162, 'Clara', 'SA_REP', 147, datetime.date(2005, 11, 11), Decimal('10500.00'), Decimal('0.25'), 'Sales'), (163, 'Danielle', 'SA_REP', 147, datetime.date(2007, 3, 19), Decimal('9500.00'), Decimal('0.15'), 'Sales'), (164, 'Mattea', 'SA_REP', 147, datetime.date(2008, 1, 24), Decimal('7200.00'), Decimal('0.10'), 'Sales'), (165, 'David', 'SA_REP', 147, datetime.date(2008, 2, 23), Decimal('6800.00'), Decimal('0.10'), 'Sales'), (166, 'Sundar', 'SA_REP', 147, datetime.date(2008, 3, 24), Decimal('6400.00'), Decimal('0.10'), 'Sales'), (167, 'Amit', 'SA_REP', 147, datetime.date(2008, 4, 21), Decimal('6200.00'), Decimal('0.10'), 'Sales'), (168, 'Lisa', 'SA_REP', 148, datetime.date(2005, 3, 11), Decimal('11500.00'), Decimal('0.25'), 'Sales'), (169, 'Harrison', 'SA_REP', 148, datetime.date(2006, 3, 23), Decimal('10000.00'), Decimal('0.20'), 'Sales'), (170, 'Tayler', 'SA_REP', 148, datetime.date(2006, 1, 24), Decimal('9600.00'), Decimal('0.20'), 'Sales'), (171, 'William', 'SA_REP', 148, datetime.date(2007, 2, 23), Decimal('7400.00'), Decimal('0.15'), 'Sales'), (172, 'Elizabeth', 'SA_REP', 148, datetime.date(2007, 3, 24), Decimal('7300.00'), Decimal('0.15'), 'Sales'), (173, 'Sundita', 'SA_REP', 148, datetime.date(2008, 4, 21), Decimal('6100.00'), Decimal('0.10'), 'Sales'), (174, 'Ellen', 'SA_REP', 149, datetime.date(2004, 5, 11), Decimal('11000.00'), Decimal('0.30'), 'Sales'), (175, 'Alyssa', 'SA_REP', 149, datetime.date(2005, 3, 19), Decimal('8800.00'), Decimal('0.25'), 'Sales'), (176, 'Jonathon', 'SA_REP', 149, datetime.date(2006, 3, 24), Decimal('8600.00'), Decimal('0.20'), 'Sales'), (177, 'Jack', 'SA_REP', 149, datetime.date(2006, 4, 23), Decimal('8400.00'), Decimal('0.20'), 'Sales'), (179, 'Charles', 'SA_REP', 149, datetime.date(2008, 1, 4), Decimal('6200.00'), Decimal('0.10'), 'Sales'))

In [73]:
# salary 범위를 받아서 그 범위의 salary를 받는 직원들을 조회한 결과를 반환하는 함수
def select_emp_range_salary(s_salary, e_salary):
    sql = 'select * from emp where salary between %s and %s'
    with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='hr', charset='utf8') as connection:
        with connection.cursor() as cursor:
            cursor.execute(sql, (s_salary, e_salary))
            return cursor.fetchall()

In [75]:
r = select_emp_range_salary(3000, 4000)
print(len(r))
print(r)

8
((125, 'Julia', 'ST_CLERK', 120, datetime.date(2005, 7, 16), Decimal('3200.00'), None, 'Shipping'), (129, 'Laura', 'ST_CLERK', 121, datetime.date(2005, 8, 20), Decimal('3300.00'), None, 'Shipping'), (133, 'Jason', 'ST_CLERK', 122, datetime.date(2004, 6, 14), Decimal('3300.00'), None, 'Shipping'), (137, 'Renske', 'ST_CLERK', 123, datetime.date(2003, 7, 14), Decimal('3600.00'), None, 'Shipping'), (138, 'Stephen', 'ST_CLERK', 123, datetime.date(2005, 10, 26), Decimal('3200.00'), None, 'Shipping'), (141, 'Trenna', 'ST_CLERK', 124, datetime.date(2003, 10, 17), Decimal('3500.00'), None, 'Shipping'), (142, 'Curtis', 'ST_CLERK', 124, datetime.date(2005, 1, 29), Decimal('3100.00'), None, 'Shipping'), (401, '홍길동', '기획', 100, datetime.date(2020, 10, 10), Decimal('3000.00'), Decimal('0.20'), '기획부'))

In [76]:
for data in r:
    print(f'이름: {data[1]}, 월급: {data[5]}')

이름: Julia, 월급: 3200.00
이름: Laura, 월급: 3300.00
이름: Jason, 월급: 3300.00
이름: Renske, 월급: 3600.00
이름: Stephen, 월급: 3200.00
이름: Trenna, 월급: 3500.00
이름: Curtis, 월급: 3100.00
이름: 홍길동, 월급: 3000.00

In [3]:
# dept_name을 매개변수로 받아서 부서별 급여 통계정보(합계, 평균, 최대, 최소)를 반환하는 함수
def select_emp_stat_by_dept_name():
    sql = 'select dept_name, sum(salary) 합계, avg(salary) 평균, max(salary) 최대급여, min(salary) 최소급여 from emp group by dept_name'
    with pymysql.connect(host='127.0.0.1', port=3306, user='hanec', password='1866', db='hr', charset='utf8', 
                         cursorclass=pymysql.cursors.DictCursor) as connection:
        with connection.cursor() as cursor:
            cursor.execute(sql)
            return cursor.fetchall()

In [4]:
r = select_emp_stat_by_dept_name()
len(r)

NameError: name 'pymysql' is not defined

In [82]:
r

[{'dept_name': 'Executive',
  '합계': Decimal('58000.00'),
  '평균': Decimal('19333.333333'),
  '최대급여': Decimal('24000.00'),
  '최소급여': Decimal('17000.00')},
 {'dept_name': 'IT',
  '합계': Decimal('28800.00'),
  '평균': Decimal('5760.000000'),
  '최대급여': Decimal('9000.00'),
  '최소급여': Decimal('4200.00')},
 {'dept_name': 'Finance',
  '합계': Decimal('51608.00'),
  '평균': Decimal('8601.333333'),
  '최대급여': Decimal('12008.00'),
  '최소급여': Decimal('6900.00')},
 {'dept_name': 'Purchasing',
  '합계': Decimal('28900.00'),
  '평균': Decimal('4816.666667'),
  '최대급여': Decimal('11000.00'),
  '최소급여': Decimal('2500.00')},
 {'dept_name': 'Shipping',
  '합계': Decimal('92100.00'),
  '평균': Decimal('3684.000000'),
  '최대급여': Decimal('8200.00'),
  '최소급여': Decimal('2100.00')},
 {'dept_name': 'Sales',
  '합계': Decimal('292500.00'),
  '평균': Decimal('8863.636364'),
  '최대급여': Decimal('14000.00'),
  '최소급여': Decimal('6100.00')},
 {'dept_name': None,
  '합계': Decimal('39000.00'),
  '평균': Decimal('9750.000000'),
  '최대급여': Decimal('12000.00'),
  '최소급여': Decimal('7000.00')},
 {'dept_name': 'Administration',
  '합계': Decimal('4400.00'),
  '평균': Decimal('4400.000000'),
  '최대급여': Decimal('4400.00'),
  '최소급여': Decimal('4400.00')},
 {'dept_name': 'Marketing',
  '합계': Decimal('19000.00'),
  '평균': Decimal('9500.000000'),
  '최대급여': Decimal('13000.00'),
  '최소급여': Decimal('6000.00')},
 {'dept_name': 'Human Resources',
  '합계': Decimal('6500.00'),
  '평균': Decimal('6500.000000'),
  '최대급여': Decimal('6500.00'),
  '최소급여': Decimal('6500.00')},
 {'dept_name': 'Public Relations',
  '합계': Decimal('10000.00'),
  '평균': Decimal('10000.000000'),
  '최대급여': Decimal('10000.00'),
  '최소급여': Decimal('10000.00')},
 {'dept_name': 'Accounting',
  '합계': Decimal('30308.00'),
  '평균': Decimal('15154.000000'),
  '최대급여': Decimal('18300.00'),
  '최소급여': Decimal('12008.00')},
 {'dept_name': '기획부',
  '합계': Decimal('3000.00'),
  '평균': Decimal('3000.000000'),
  '최대급여': Decimal('3000.00'),
  '최소급여': Decimal('3000.00')}]